#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/benoit/mytest/runs/run-StS7RQYzqRCdbmFL

Waiting for the plan to start...

Terraform v1.1.2
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
aws_ecr_repository.diag: Refreshing state... [id=diag]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_ecr_repository.diag has changed
  ~ resource "aws_ecr_repository" "diag" {
        id                   = "diag"
        name                 = "diag"
      + tags                 = {}
        # (4 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_access_key.github will be created
  + resource "aws_iam_access_key" "github" {
      + encrypted_secret     = (known after apply)
      + id                   = (known after apply)
      + key_fingerprint      = (known after apply)
      + secret               = (sensitive value)
      + ses_smtp_password_v4 = (sensitive value)
      + status               = (known after apply)
      + user                 = "github"
    }

  # aws_iam_group.github will be created
  + resource "aws_iam_group" "github" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "github"
      + path      = "/"
      + unique_id = (known after apply)
    }

  # aws_iam_group_membership.github will be created
  + resource "aws_iam_group_membership" "github" {
      + group = "github"
      + id    = (known after apply)
      + name  = "github"
      + users = [
          + "github",
        ]
    }

  # aws_iam_policy.ecr_access will be created
  + resource "aws_iam_policy" "ecr_access" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + name   = "ecr_access"
      + path   = "/"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:PutImage",
                          + "ecr:InitiateLayerUpload",
                          + "ecr:UploadLayerPart",
                          + "ecr:CompleteLayerUpload",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ecr:us-west-2:144149190966:repository/diag",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_iam_role.ecr_access will be created
  + resource "aws_iam_role" "ecr_access" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecr.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ecr_access"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.ecr_access will be created
  + resource "aws_iam_role_policy_attachment" "ecr_access" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ecr_access"
    }

  # aws_iam_user.github will be created
  + resource "aws_iam_user" "github" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "github"
      + path          = "/"
      + unique_id     = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + github_iam_access_key_id = (known after apply)
  + github_iam_secret_key_id = (sensitive value)
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_SECRET_ACCESS_KEY"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_ACCESS_KEY_ID" but a
│ value was found in file "/terraform/terraform.tfvars". If you meant to use
│ this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

```
</details>
*Pusher: @bbourbie, Action: `pull_request`*